//Задайте значения M и N.
//Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
//Использовать рекурсию, не использовать циклы.


System.Console.WriteLine("Введите число m");
int m =Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine("Введите число n");
int n =Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine();


void output(int m)
{
    int result=m;
    result=result+1;
    System.Console.Write(result+" ");
if(result<n)
{
    output(result);
}
return;   
}
output(m-1);